# RemoveEnhancedPullDownMenuItemRange

## Description
Removes the specified range of items from the specified Layout Manager enhanced pull down menu control.

```pascal
PROCEDURE RemoveEnhancedPullDownMenuItemRange(
				dialogID                : LONGINT;
				componentID             : LONGINT;
				iStartItemIndexToRemove : INTEGER;
				iEndItemIndexToRemove   : INTEGER);
```

```python
def vs.RemoveEnhancedPullDownMenuItemRange(dialogID, componentID, iStartItemIndexToRemove, iEndItemIndexToRemove):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|   |
|componentID|LONGINT|   |
|iStartItemIndexToRemove|INTEGER|   |
|iEndItemIndexToRemove|INTEGER|   |

## Version
Availability: from VectorWorks12.5

## Category
* Dialogs - Modern